# brewfile

tap "azure/kubelogin"
tap "hashicorp/tap"

cask "1password-cli"

brew "awscli"
brew "azure-cli"
brew "azure/kubelogin/kubelogin"
brew "bash"
brew "coreutils"
brew "direnv"
brew "git-lfs"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg"
brew "hadolint"
brew "hashicorp/tap/packer"
brew "helm"
brew "jq"
brew "kubernetes-cli"
brew "kustomize"
brew "lftp"
brew "nmap"
brew "oci-cli"
brew "openshift-cli"
brew "pinentry-mac"
brew "shellcheck"
brew "shfmt"
brew "telnet"
brew "terraform"
brew "tmate"
brew "tmux"
brew "wrk"
brew "yq"

# dependencies

brew "autoconf"
brew "pkg-config"

# dependencies (phpenv)

brew "bzip2"
brew "icu4c"
brew "libiconv"
brew "libxml2"
brew "libzip"
brew "openssl@1.1"
brew "tidy-html5"

# dependencies (pyenv)

brew "libffi" # CPPFLAGS, LDFLAGS, PKG_CONFIG_PATH
brew "openssl@3" # CPPFLAGS, LDFLAGS, PKG_CONFIG_PATH
brew "readline"
brew "sqlite" # CPPFLAGS, LDFLAGS, PKG_CONFIG_PATH
