# brewfile

tap "azure/kubelogin"
tap "hashicorp/tap"

cask "1password-cli"

brew "awscli"
brew "azure-cli"
brew "azure/kubelogin/kubelogin"
brew "bash"
brew "coreutils"
brew "git-lfs"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg"
brew "hadolint"
brew "hashicorp/tap/packer"
brew "helm"
brew "jq"
brew "kubernetes-cli"
brew "kustomize"
brew "lftp"
brew "nmap"
brew "oci-cli"
brew "openshift-cli"
brew "opentofu"
brew "pinentry-mac"
brew "pre-commit"
brew "shellcheck"
brew "shfmt"
brew "sysbench"
brew "telnet"
brew "tmate"
brew "tmux"
brew "wrk"
brew "yq"

# dependencies

brew "autoconf" # used by: phpenv
brew "automake" # used by: phpenv
brew "bison" # used by: phpenv
brew "bzip2" # used by: phpenv
brew "freetype" # used by: phpenv
brew "gd" # used by: phpenv
brew "gettext" # used by: phpenv
brew "icu4c" # used by: phpenv
brew "krb5" # used by: phpenv
brew "libedit" # used by: phpenv
brew "libffi" # used by: pyenv | used in: CPPFLAGS, LDFLAGS, PKG_CONFIG_PATH
brew "libiconv" # used by: phpenv
brew "libjpeg" # used by: phpenv
brew "libpng" # used by: phpenv
brew "libxml2" # used by: phpenv
brew "libyaml" # used by: rbenv
brew "libzip" # used by: phpenv
brew "openssl@3" # used by: pyenv, rbenv | used in: CPPFLAGS, LDFLAGS, PKG_CONFIG_PATH
brew "pkg-config" # used by: phpenv
brew "re2c" # used by: phpenv
brew "readline" # used by: pyenv, rbenv
brew "sqlite" # used by: pyenv | used in: CPPFLAGS, LDFLAGS, PKG_CONFIG_PATH
brew "zlib" # used by: phpenv
